snlkuharlocal/src/DataProcessors/ПоискИнформацииПоКМ/ПоискИнформацииПоКМ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ПоискИнформацииПоКМ</name>
</mdclass:DataProcessor>

snlkuharlocal/src/Enums/ТипыКодовМаркировки/ТипыКодовМаркировки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыКодовМаркировки</name>
  <enumValues>
    <name>Товар</name>
  </enumValues>
  <enumValues>
    <name>Набор</name>
  </enumValues>
  <enumValues>
    <name>ЛогистическаяУпаковка</name>
  </enumValues>
  <enumValues>
    <name>АТК</name>
  </enumValues>
</mdclass:Enum>

snlkuharlocal/src/Documents/МаркировкаТоваровИСМП/МаркировкаТоваровИСМП.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>МаркировкаТоваровИСМП</name>
  <comment>Маркировка товаров ИСМП</comment>
  <basedOn>Document.ЗаказПоставщику</basedOn>
  <basedOn>Document.ЗаказНаЭмиссиюКодовМаркировкиСУЗ</basedOn>
  <basedOn>Document.РасходнаяНакладная</basedOn>
  <basedOn>Document.СписаниеТМЦ</basedOn>
  <basedOn>Document.ОтчетКассовойСмены</basedOn>
  <basedOn>Document.ПриходнаяНакладная</basedOn>
  <basedOn>Document.ЗаданиеНаМаркировку</basedOn>
  <basedOn>Document.ЗаданиеНаСборкуКомплектовЧЗ</basedOn>
  <basedOn>Document.ЛистНабора</basedOn>
  <basedOn>Document.Перемещение</basedOn>
  <basedOn>Document.МаркировкаТоваровИСМП</basedOn>
  <basedOn>Document.КонтрактСПроизводителем</basedOn>
  <basedOn>Document.РекламационнаяНакладная</basedOn>
  <registerRecords>InformationRegister.СтатусыКМ_Факт</registerRecords>
  <registerRecords>InformationRegister.ИспользованныеКодыАгрегаций</registerRecords>
  <registerRecords>InformationRegister.СтатусыКМ_ЧЗ</registerRecords>
  <registerRecords>AccumulationRegister.ОстаткиДоступныхКМ</registerRecords>
  <registerRecords>InformationRegister.СтатусыКМ_Факт_А</registerRecords>
  <registerRecords>InformationRegister.ВыданныеКодыАгрегаций</registerRecords>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>АТК</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидОперации</name>
    <type>
      <types>EnumRef.ВидыОперацийМаркировки</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидОперацииИСМП</name>
    <type>
      <types>EnumRef.ВидыОперацийИСМП</types>
    </type>
  </attributes>
  <attributes>
    <name>ГруппыТоваров</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.Комплектация</types>
      <types>DocumentRef.ОтчетКассовойСмены</types>
      <types>DocumentRef.ЗаказНаЭмиссиюКодовМаркировкиСУЗ</types>
      <types>DocumentRef.КонтрактСПроизводителем</types>
      <types>DocumentRef.ПриходнаяНакладная</types>
      <types>DocumentRef.ЗаказПоставщику</types>
      <types>DocumentRef.ЗаданиеНаСборкуКомплектовЧЗ</types>
      <types>DocumentRef.Инвентаризация</types>
      <types>DocumentRef.РекламационнаяНакладная</types>
      <types>DocumentRef.РасходнаяНакладная</types>
      <types>DocumentRef.ЛистНабора</types>
      <types>DocumentRef.СписаниеТМЦ</types>
      <types>DocumentRef.ЗаданиеНаМаркировку</types>
      <types>DocumentRef.МаркировкаТоваровИСМП</types>
      <types>DocumentRef.Машина</types>
      <types>DocumentRef.Перемещение</types>
    </type>
  </attributes>
  <attributes>
    <name>ИД_ДокументаЧЗ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>СтавкаНДС</name>
    <type>
      <types>EnumRef.СтавкиНДС</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыДокументовМаркировки</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекстОшибки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТНВЭД</name>
    <type>
      <types>CatalogRef.ТНВЭД</types>
    </type>
  </attributes>
  <attributes>
    <name>КодУзлаСоздания</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>3</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипДокумента</name>
    <type>
      <types>EnumRef.ТипыДокументовИСМП</types>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеПервичногоДокумента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОписаниеПричины</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторГосКонтракта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Страна</name>
    <type>
      <types>CatalogRef.КлассификаторСтранМира</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмпортерИД</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПодписанныеДанные</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ВозвращаемыйТоварБылОплачен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодразделениеНанесения</name>
    <type>
      <types>CatalogRef.Подразделения</types>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоКодовSSCC</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипУпаковки</name>
    <type>
      <types>EnumRef.ТипыУпаковок</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипШК</name>
    <type>
      <types>EnumRef.ТипыШтрихКодов</types>
    </type>
  </attributes>
  <attributes>
    <name>фКодыАгрегацийДляПоставщиков</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусыАктуализированы</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СозданАвтоматически</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ШтрихкодУпаковки</name>
    <type>
      <types>CatalogRef.ШтрихкодыУпаковокТоваров</types>
    </type>
  </attributes>
  <attributes>
    <name>ИННПокупателя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбработанЧЗ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ШтрихкодыУпаковок</name>
    <attributes>
      <name>ШтрихкодУпаковки</name>
      <type>
        <types>CatalogRef.ШтрихкодыУпаковокТоваров</types>
      </type>
    </attributes>
    <attributes>
      <name>КодАгрегации</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>18</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДокументОснование</name>
      <type>
        <types>DocumentRef.РасходнаяНакладная</types>
      </type>
    </attributes>
    <attributes>
      <name>ШтрихкодНабора</name>
      <type>
        <types>CatalogRef.ШтрихкодыУпаковокТоваров</types>
      </type>
    </attributes>
    <attributes>
      <name>ШтрихкодКоробки</name>
      <type>
        <types>CatalogRef.ШтрихкодыУпаковокТоваров</types>
      </type>
    </attributes>
    <attributes>
      <name>ДокументАгрегации</name>
      <type>
        <types>DocumentRef.МаркировкаТоваровИСМП</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ШтрихкодыКоробок</name>
    <attributes>
      <name>ШтрихкодКоробки</name>
      <type>
        <types>CatalogRef.ШтрихкодыУпаковокТоваров</types>
      </type>
    </attributes>
    <attributes>
      <name>ДокументОснование</name>
      <type>
        <types>DocumentRef.ЛистПереукладки</types>
        <types>DocumentRef.РасходнаяНакладная</types>
        <types>DocumentRef.ЛистНабора</types>
        <types>DocumentRef.Перемещение</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаДобавления</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДокументыОснования</name>
    <attributes>
      <name>ДокументОснование</name>
      <type>
        <types>DocumentRef.Комплектация</types>
        <types>DocumentRef.ОтчетКассовойСмены</types>
        <types>DocumentRef.ЗаказНаЭмиссиюКодовМаркировкиСУЗ</types>
        <types>DocumentRef.КонтрактСПроизводителем</types>
        <types>DocumentRef.ПриходнаяНакладная</types>
        <types>DocumentRef.ЗаказПоставщику</types>
        <types>DocumentRef.ЗаданиеНаСборкуКомплектовЧЗ</types>
        <types>DocumentRef.Инвентаризация</types>
        <types>DocumentRef.РасходнаяНакладная</types>
        <types>DocumentRef.ЛистНабора</types>
        <types>DocumentRef.СписаниеТМЦ</types>
        <types>DocumentRef.ЗаданиеНаМаркировку</types>
        <types>DocumentRef.МаркировкаТоваровИСМП</types>
        <types>DocumentRef.Машина</types>
        <types>DocumentRef.Перемещение</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

snlkuharlocal/src/Catalogs/ШтрихкодыУпаковокТоваров/ШтрихкодыУпаковокТоваров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ШтрихкодыУпаковокТоваров</name>
  <owners>Catalog.Номенклатура</owners>
  <attributes>
    <name>ДатаУпаковки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаказКМ</name>
    <type>
      <types>DocumentRef.ЗаказНаЭмиссиюКодовМаркировкиСУЗ</types>
      <types>DocumentRef.МаркировкаТоваровИСМП</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗначениеШтрихкода</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>220</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодировкаШтрихкода</name>
    <type>
      <types>EnumRef.ТипыКодировокШК</types>
    </type>
  </attributes>
  <attributes>
    <name>Количество</name>
    <comment>Количество в базовых единицах</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Партия</name>
    <type>
      <types>DocumentRef.Комплектация</types>
      <types>DocumentRef.ПриходнаяНакладная</types>
      <types>DocumentRef.ЗаказПоставщику</types>
      <types>DocumentRef.Инвентаризация</types>
      <types>DocumentRef.РасходнаяНакладная</types>
      <types>DocumentRef.Машина</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипКода</name>
    <type>
      <types>EnumRef.ТипыКодовМаркировки</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипУпаковки</name>
    <type>
      <types>EnumRef.ТипыУпаковок</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипШК</name>
    <type>
      <types>EnumRef.ТипыШтрихКодов</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособВводаВОборот</name>
    <type>
      <types>EnumRef.СпособыВводаВОборотСУЗ</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ВложенныеТовары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ВложенныеШтрихкоды</name>
    <attributes>
      <name>Штрихкод</name>
      <type>
        <types>CatalogRef.ШтрихкодыУпаковокТоваров</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

snlkuharlocal/src/DataProcessors/ПоискИнформацииПоКМ/Forms/Форма/Module.bsl
#Область ОбработчикиСобытий
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("МассивКМ") Тогда
		
		ЗаполнитьМассивКМПоШК(Параметры.МассивКМ); 
		
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УстановитьВидимостьКнопкиОтбор();
КонецПроцедуры

#КонецОбласти

#Область Команды
&НаКлиенте
Процедура ПроверитьКоды(Команда)
	
	ИнформацияТЧ.Очистить();
	
	//++Данилова Е.В. 23.04.2026 HELP-9550
	//МассивКМ = ПолучитьМассивКМНаСервере();
	//
	//
	//ПараметрыФона = Новый Массив; 
	//ПараметрыФона.Добавить(МассивКМ); 
	//
	////++Данилова Е.В. 23.04.2026 HELP-9550 	
	////пВыполнения = инт_ДлительныеОперации.ПараметрыВыполненияФункции(Новый УникальныйИдентификатор);
	//пВыполнения = инт_ДлительныеОперации.ПараметрыВыполненияФункции(ЭтаФорма.УникальныйИдентификатор);
	////--Данилова Е.В. 23.04.2026 
	//рЗапуска = инт_ДлительныеОперации.ВыполнитьВФоне("Обработка.АпиЧЗ.ПолучитьДанныеИзЧЗПоКодамКМ", ПараметрыФона, пВыполнения);	
	//
	
	рЗапуска = ВыполнитьФонПоискаНаСервере();
	//--Данилова Е.В. 23.04.2026 
	Если рЗапуска.Статус = "Ошибка" Тогда
		Сообщить(рЗапуска.ПодробноеПредставлениеОшибки, СтатусСообщения.Важное);
		Возврат;
	КонецЕсли;
	
	пОжидания = инт_ДлительныеОперацииК.ПараметрыОжидания(ЭтотОбъект);
	пОжидания.ВыводитьПрогрессВыполнения = Истина;
	пОжидания.Заголовок = "Получение данных из ЧЗ по КМ";
	
	ооЗавершение = Новый ОписаниеОповещения("ОжиданиеЗавершенияФЗ", ЭтотОбъект,Новый Структура("ЗапросВЧЗ",Истина));
	
	инт_ДлительныеОперацииК.ОжидатьЗавершение(рЗапуска, ооЗавершение, пОжидания);
	
	
КонецПроцедуры 
//++Данилова Е.В. 23.04.2026 HELP-9550
&НаСервере
Функция ВыполнитьФонПоискаНаСервере()

	МассивКМ = ПолучитьМассивКМНаСервере();
	
	
	ПараметрыФона = Новый Массив; 
	ПараметрыФона.Добавить(МассивКМ); 
	
	//++Данилова Е.В. 23.04.2026 HELP-9550 	
	//пВыполнения = инт_ДлительныеОперации.ПараметрыВыполненияФункции(Новый УникальныйИдентификатор);
	пВыполнения = инт_ДлительныеОперации.ПараметрыВыполненияФункции(ЭтаФорма.УникальныйИдентификатор);  
	//рЗапуска = инт_ДлительныеОперации.ВыполнитьВФоне("Обработка.АпиЧЗ.ПолучитьДанныеИзЧЗПоКодамКМ", ПараметрыФона, пВыполнения);
	//рЗапуска = инт_ДлительныеОперации.ВыполнитьВФоне("ОбменСЧЗЧерезОУКЭПСервер.ПроверитьМаркиЧЗНаСервере", ПараметрыФона, пВыполнения);
	пВыполнения.АдресРезультата = ПоместитьВоВременноеХранилище(Неопределено, ЭтаФорма.УникальныйИдентификатор);
	рЗапуска = инт_ДлительныеОперации.ВыполнитьФункцию(пВыполнения,"ОбменСЧЗЧерезОУКЭПСервер.ПроверитьМаркиЧЗНаСервере",МассивКМ,пВыполнения.АдресРезультата);
	//--Данилова Е.В. 23.04.2026
	Возврат рЗапуска; 

КонецФункции // ВыполнитьФонНаСервере()

//--Данилова Е.В. 23.04.2026

&НаКлиенте
Процедура ВыбратьИзДокумента(Команда)
	Перем ВыбранныйДокумент;
	
	
	
	МассивТипов = Новый Массив; 
	МассивТипов.Добавить(Тип("ДокументСсылка.ЗаказНаЭмиссиюКодовМаркировкиСУЗ")); 
	МассивТипов.Добавить(Тип("ДокументСсылка.МаркировкаТоваровИСМП"));
	МассивТипов.Добавить(Тип("ДокументСсылка.ПриходнаяНакладная"));
	//++Данилова Е.В. 20.10.2025 MARK-3138
	МассивТипов.Добавить(Тип("ДокументСсылка.ХранилищеКодовМаркировки"));
	МассивТипов.Добавить(Тип("ДокументСсылка.РекламационнаяНакладная"));
	//--Данилова Е.В. 20.10.2025
	
	ОписаниеТиповСоставной = Новый ОписаниеТипов(МассивТипов);
	
	ОповещениеВводЗначения = Новый ОписаниеОповещения("ПослеВыбораДокумента",ЭтаФорма); 
	ПоказатьВводЗначения(ОповещениеВводЗначения,ВыбранныйДокумент,,ОписаниеТиповСоставной); 
КонецПроцедуры

&НаКлиенте
Процедура ВключитьОтбор(Команда)
	
	ОтборПоСтрокам = Истина; 
	ДанныеКМПриАктивизацииСтрокиОтбор(); 
	УстановитьВидимостьКнопкиОтбор(); 
	
КонецПроцедуры

&НаКлиенте
Процедура ОтключитьОтбор(Команда)
	
	ОтборПоСтрокам = Ложь; 
	Элементы.ИнформацияТЧ.ОтборСтрок = неопределено;
	УстановитьВидимостьКнопкиОтбор(); 
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьКоды(Команда)
	Для Каждого ШтрихкодУпаковки Из ВвестиКоды() Цикл
		
		СтрокаТЧ = ДанныеКМ.Добавить();
		Если ТипЗнч(ШтрихкодУпаковки) = Тип("СправочникСсылка.ШтрихкодыУпаковокТоваров") Тогда
			
			СтрокаТЧ.ШКУпаковки = ШтрихкодУпаковки;	
			СтрокаТЧ.ЗначениеШК = ЗначениеРеквизитаШКУпаковки(ШтрихкодУпаковки);
		Иначе 
			СтрокаТЧ.ЗначениеШК = ШтрихкодУпаковки; 
		КонецЕсли;		
		
	КонецЦикла;
	ПерезаполнитьНомерСтроки();
КонецПроцедуры

&НаКлиенте
Процедура УдалитьКоды(Команда)
	Для Каждого ШтрихкодУпаковки Из ВвестиКоды() Цикл
		Если ТипЗнч(ШтрихкодУпаковки) = Тип("СправочникСсылка.ШтрихкодыУпаковокТоваров") Тогда 			
			Строки = ДанныеКМ.НайтиСтроки(Новый Структура("ШКУпаковки", ШтрихкодУпаковки));
		Иначе
			Строки = ДанныеКМ.НайтиСтроки(Новый Структура("ЗначениеШК", ШтрихкодУпаковки));
		КонецЕсли; 
		Для Каждого Строка Из Строки Цикл
			ДанныеКМ.Удалить(Строка);		
		КонецЦикла;
	КонецЦикла;
	ПерезаполнитьНомерСтроки();
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	Если ВыбранноеЗначение = Неопределено Тогда
	
		Возврат; 	
		
	КонецЕсли;
	
	ОтработатьПодборШК(ВыбранноеЗначение);
	ПерезаполнитьНомерСтроки(); 

КонецПроцедуры

#КонецОбласти

// <Описание процедуры>
//
// Параметры:
//  <Параметр1>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//  <Параметр2>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//
&НаСервере
Процедура ЗаполнитьМассивКМПоШК(МассивШК)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ШтрихкодыУпаковокТоваров.Ссылка КАК ШКУпаковки,
		|	ШтрихкодыУпаковокТоваров.Наименование КАК ЗначениеШК
		|ИЗ
		|	Справочник.ШтрихкодыУпаковокТоваров КАК ШтрихкодыУпаковокТоваров
		|ГДЕ
		|	ШтрихкодыУпаковокТоваров.Ссылка В(&МассивШК)";
	
	Запрос.УстановитьПараметр("МассивШК", МассивШК);
	
	ДанныеКМ.Загрузить(Запрос.Выполнить().Выгрузить());
	
КонецПроцедуры // ЗаполнитьМассивКМПоШК()

&НаСервере
Функция ПолучитьМассивКМНаСервере()
	
	Перем МассивКМ;
	
	МассивКМ = ДанныеКМ.Выгрузить().ВыгрузитьКолонку("ЗначениеШК");
	
	Возврат МассивКМ;  	
	
	
КонецФункции

&НаКлиенте
Процедура ОжиданиеЗавершенияФЗ(Результат = Неопределено, ДопПараметры = Неопределено) Экспорт
	Если ТипЗнч(Результат) = Тип("Структура") Тогда		
		Если Результат.Статус = "Выполнено" Тогда  			
						
			Если ЭтоАдресВременногоХранилища(Результат.АдресРезультата) Тогда
				ДанныеЗапроса = ПолучитьИзВременногоХранилища(Результат.АдресРезультата);
				//Данилова Е.В. 24.03.2025
				Если ДанныеЗапроса = неопределено Тогда
				
					ЗаписатьВЛог("Получение информации КМ","Результат фонового задания неопределено","Ошибка"); 	
				    ВозВрат; 
					
				КонецЕсли;
				Если ДопПараметры.ЗапросВЧЗ  Тогда
					
					ОтработатьУспешныйРезультат(ДанныеЗапроса);
					//++Данилова Е.В. 05.03.2025 MARK-1462 
					ОтработатьНеНайденныеКодыКМ(ДанныеЗапроса); 
					//--Данилова Е.В. 05.03.2025	
				Иначе
					Для каждого СоответствиеИзМассива Из ДанныеЗапроса.Данные Цикл
						
						Для каждого ЭлементСоответствия Из СоответствиеИзМассива Цикл
							
							НоваяСтрока = ИнформацияТЧ.Добавить(); 
							ЗаполнитьЗначенияСвойств(НоваяСтрока,ЭлементСоответствия.Значение); 
							
						КонецЦикла;
						
					КонецЦикла;
				КонецЕсли;
				
				ПерезаполнитьНомерСтроки("ИнформацияТЧ");
				
				Если НЕ ДанныеЗапроса.Успешно Тогда
					
					МаркировкаКС.ВывестиОшибки(ДанныеЗапроса);
					
				КонецЕсли; 					
				
				
			Иначе
				ДанныеЗапроса = Неопределено;
			КонецЕсли; 
			
		ИначеЕсли Результат.Статус = "Ошибка" Тогда
			Сообщить(Результат.ПодробноеПредставлениеОшибки, СтатусСообщения.Важное);		
		КонецЕсли;	
	Иначе
		Сообщить("Некорректный тип результата фонового задания: " + ТипЗнч(Результат)+" ! Ожидаемый тип: 'Структура' !", СтатусСообщения.Важное);
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Процедура ОтработатьНеНайденныеКодыКМ(Знач ДанныеЗапроса) 	
		
	Если ДанныеЗапроса.Сообщения.Количество() > 0  Тогда
		
		Для каждого МассивНеОтрабКодовСтрока Из ДанныеЗапроса.Сообщения Цикл
			
			МассивНеОтрабКодов = СтрРазделить(МассивНеОтрабКодовСтрока,";"); 
			
			Для каждого КодНеОтработанный  Из МассивНеОтрабКодов Цикл
				
				НоваяСтрока = ИнформацияТЧ.Добавить();
				НоваяСтрока.requestedCis = КодНеОтработанный; 
				НоваяСтрока.errorMessage = "КИ не найден";
				НоваяСтрока.ШК  = НайтиШКПоКМ(КодНеОтработанный);
				//НоваяСтрока.СтатусЧЗФакт = СтатусЧЗФакт(НоваяСтрока.ШК);
				ДанныеФакт = СтатусЧЗФакт(НоваяСтрока.ШК); 
				НоваяСтрока.СтатусЧЗФакт = ДанныеФакт.Статус;
				НоваяСтрока.Местонахождение = ДанныеФакт.Местонахождение;
				
			КонецЦикла;
			
		КонецЦикла;
		
		
		
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ОтработатьУспешныйРезультат(Знач ДанныеЗапроса)
	
	КолонкиТЧ 	= КолонкиТЧИнформация();
	Перевод 	= ПереводЗначенияАПИСоответствие();  
	
	Для каждого  ОтработДанныеЗапроса Из ДанныеЗапроса.Данные Цикл
		
		Если ОтработДанныеЗапроса.Успешно  Тогда  		
			
			
			Для каждого ЭлементМассива Из ОтработДанныеЗапроса.Данные Цикл  //ответ 
				
				ДанныеМассив = МаркировкаКС.ПрочитатьЖСОН(ЭлементМассива); //приходит массив
				
				Если ТипЗнч(ДанныеМассив) = Тип("Массив")  Тогда					
					
					Для каждого ДанныеСтруктура Из  ДанныеМассив Цикл
						
						Если ДанныеСтруктура.Свойство("cisInfo")  Тогда
							
							ЗаполнитьСтрокиТаблицы(ДанныеСтруктура.cisInfo,Перевод,КолонкиТЧ); 
							
						КонецЕсли;  									
						
					КонецЦикла; 
					
					
				ИначеЕсли ТипЗнч(ДанныеМассив) = Тип("Структура")
					И ДанныеСтруктура.Свойство("gis") Тогда
					
					ЗаполнитьСтрокиТаблицы(ДанныеСтруктура.gis,Перевод,КолонкиТЧ);
					
				КонецЕсли;
				
			КонецЦикла;
			
			Модифицированность = Ложь; 
			
		Иначе 
			
			МаркировкаКС.ВывестиОшибки(ОтработДанныеЗапроса); 
			
		КонецЕсли;
		
	КонецЦикла;

КонецПроцедуры

// <Описание функции>
//
// Параметры:
//  <Параметр1>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//  <Параметр2>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//
// Возвращаемое значение:
//   <Тип.Вид>   - <описание возвращаемого значения>
//
&НаСервере
Функция КолонкиТЧИнформация()

	 Возврат ИнформацияТЧ.Выгрузить().Колонки; 

КонецФункции // ()

Функция ПолучитьСУЗПоОрганизации(ОрганизацияСуз)
	СУЗ = Справочники.СтанцииУправленияЗаказамиИСМП.ПустаяСсылка();
	
	Запрос = новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СтанцииУправленияЗаказамиИСМП.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.СтанцииУправленияЗаказамиИСМП КАК СтанцииУправленияЗаказамиИСМП
	|ГДЕ
	|	СтанцииУправленияЗаказамиИСМП.Владелец.ИНН = &ИНН
	// |	И СтанцииУправленияЗаказамиИСМП.Наименование ПОДОБНО &СтрокаПоиска
	|	И НЕ СтанцииУправленияЗаказамиИСМП.Владелец.ПометкаУдаления
	|	И СтанцииУправленияЗаказамиИСМП.СУЗДляОУКЭП";
	
	// Запрос.УстановитьПараметр("СтрокаПоиска", "Боевой%");
	Запрос.УстановитьПараметр("ИНН",ОрганизацияСуз);
	Результат = запрос.Выполнить().Выгрузить();
	Для Каждого СТрРезультат ИЗ Результат Цикл
		Суз = СТрРезультат.Ссылка;
	КонецЦикла;
	Возврат Суз;
КонецФункции

Функция ПолучитьСписокСертификатовСИНН() 
	Менеджер	= Новый МенеджерКриптографии("Crypto-Pro GOST R 34.10-2012 Cryptographic Service Provider","",80);
	Хранилище 	= Менеджер.ПолучитьХранилищеСертификатов(ТипХранилищаСертификатовКриптографии.ПерсональныеСертификаты);
	
	СписокСертификатов = Новый СписокЗначений;
	Для Каждого Сертификат Из Хранилище.ПолучитьВсе() Цикл		
		Если Сертификат.ИспользоватьДляПодписи И Сертификат.ДатаОкончания>=НачалоДня(ТекущаяДата()) Тогда
			Наименование = 	""+ ПолучитьЗначениеПараметра(Сертификат.Субъект, "OID1_2_643_100_4");
			СписокСертификатов.Добавить(ДвоичныеДанныевHEX(Сертификат.Отпечаток), Наименование);
		КонецЕсли; 
	КонецЦикла; 
	
	Возврат СписокСертификатов;
КонецФункции

Функция ПолучитьЗначениеПараметра(СтруктураПараметров,Имя,ЗначениеПоУмолчанию=Неопределено) 
	Возврат МаркировкаКС.ПолучитьЗначениеПараметра(СтруктураПараметров, Имя, ЗначениеПоУмолчанию);
КонецФункции

Функция ДвоичныеДанныевHEX(Данные) 
	Результат = "";
	
	КодыХЕКС = СтрРазделить("0,1,2,3,4,5,6,7,8,9,A,B,C,D,E,F", ",");
	
	ЧтениеДанных = Новый ЧтениеДанных(Данные);		
	Байт = ЧтениеДанных.ПрочитатьБайт();		
	Пока Байт <> Неопределено Цикл        	
		H 	= Цел(Байт / 16);
		L	= Байт % 16;
		
		Результат = Результат+КодыХЕКС[H]+КодыХЕКС[L];		
		Байт = ЧтениеДанных.ПрочитатьБайт();
	КонецЦикла;
	
	Возврат Результат;
КонецФункции

Функция ПроверитьВведенныеКоды()
	
	
	
КонецФункции // ПроверитьВведенныеКоды ()

&НаКлиенте
Процедура ДанныеКМКодМаркировкиПриИзменении(Элемент)
	Текущиеданные = Элементы.ДанныеКМ.ТекущиеДанные; 
	Если Текущиеданные <> Неопределено Тогда
		
		Текущиеданные.ЗначениеШК = ЗначениеРеквизитаШКУпаковки(Текущиеданные.ШКУпаковки); 	
		
	КонецЕсли;
	Модифицированность = Истина; 
КонецПроцедуры

// <Описание функции>
//
// Параметры:
//  <Параметр1>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//  <Параметр2>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//
// Возвращаемое значение:
//   <Тип.Вид>   - <описание возвращаемого значения>
//
&НаСервереБезКонтекста
Функция ЗначениеРеквизитаШКУпаковки(ШКУпаковки)
	
	Возврат ШКУпаковки.Наименование; 
	
КонецФункции // ЗначениеРеквизита()

&НаКлиенте
Процедура ДанныеКМПриАктивизацииСтроки(Элемент)
	
	ДанныеКМПриАктивизацииСтрокиОтбор();

	
КонецПроцедуры

&НаКлиенте
Процедура ДанныеКМПриАктивизацииСтрокиОтбор()
	
	Перем Текущиеданные, ФиксированныйОтбор;
	
	Текущиеданные = Элементы.ДанныеКМ.ТекущиеДанные;
	
	Если Текущиеданные <> Неопределено
		И ОтборПоСтрокам Тогда
		
		Если ЗначениеЗаполнено(Текущиеданные.ШКУпаковки) Тогда
		
			ФиксированныйОтбор = Новый ФиксированнаяСтруктура(Новый Структура("ШК",Текущиеданные.ШКУпаковки));	
		Иначе 
			ФиксированныйОтбор = Новый ФиксированнаяСтруктура(Новый Структура("requestedCis",Текущиеданные.ЗначениеШК));
		КонецЕсли;
		
		
		Элементы.ИнформацияТЧ.ОтборСтрок = ФиксированныйОтбор ; 
		
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСтрокиТаблицы(ДанныеЗаполнения,Перевод, КолонкиТЧ)   	
	
	НоваяСтрока = ИнформацияТЧ.Добавить();
	
	Для каждого ЭлементСтруктуры Из ДанныеЗаполнения Цикл
		
		Если КолонкиТЧ.Найти(ЭлементСтруктуры.Ключ) = Неопределено Тогда
			
			Продолжить; 	
			
		КонецЕсли; 
		
		
		Если ЭлементСтруктуры.Ключ = "cis"
			ИЛИ ЭлементСтруктуры.Ключ = "requestedCis" Тогда
			
			Если НЕ ЗначениеЗаполнено(НоваяСтрока.ШК)  Тогда
				
				НоваяСтрока.ШК  = НайтиШКПоКМ(ЭлементСтруктуры.Значение);
				ДанныеФакт = СтатусЧЗФакт(НоваяСтрока.ШК); 
				НоваяСтрока.СтатусЧЗФакт = ДанныеФакт.Статус;
				НоваяСтрока.Местонахождение = ДанныеФакт.Местонахождение;
				
			КонецЕсли;
			 
			
		КонецЕсли;
		
		Если ЭлементСтруктуры.Ключ = "child"
			ИЛИ ЭлементСтруктуры.Ключ = "ogvs" 
			 ИЛИ ЭлементСтруктуры.Ключ = "certDoc" Тогда
			
			ЗначениеКлюча = СтрСоединить(ЭлементСтруктуры.Значение,";");
			
		ИначеЕсли  ЭлементСтруктуры.Ключ = "emissionDate" 
			ИЛИ ЭлементСтруктуры.Ключ = "introducedDate"
			ИЛИ ЭлементСтруктуры.Ключ = "applicationDate"
			ИЛИ ЭлементСтруктуры.Ключ = "date" Тогда
			
			ЗначениеКлюча = ПрочитатьДатуJSON(ЭлементСтруктуры.Значение, ФорматДатыJSON.ISO); 
		Иначе
			ЗначениеКлюча  = ПереводЗначенияАПИ(ЭлементСтруктуры.Значение,Перевод); 
		КонецЕсли;
		
		
		НоваяСтрока[ЭлементСтруктуры.Ключ] = ЗначениеКлюча;
		
	КонецЦикла;
	
КонецПроцедуры // ЗаполнитьСтрокиТаблицы()

&НаСервереБезКонтекста
Функция НайтиШКПоКМ(Знач КМ)
	
	//Запрос = Новый Запрос;
	//Запрос.Текст = 
	//"ВЫБРАТЬ
	//|	ШтрихкодыУпаковокТоваров.Ссылка КАК Ссылка
	//|ИЗ
	//|	Справочник.ШтрихкодыУпаковокТоваров КАК ШтрихкодыУпаковокТоваров
	//|ГДЕ
	//|	НЕ ШтрихкодыУпаковокТоваров.ПометкаУдаления
	//|	И ШтрихкодыУпаковокТоваров.Наименование ПОДОБНО &Наименование";
	//
	//Запрос.УстановитьПараметр("Наименование", СокрЛП(КМ));
	//
	//РезультатЗапроса = Запрос.Выполнить();
	//
	//ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	//
	//Если ВыборкаДетальныеЗаписи.Следующий() Тогда
	//	Возврат ВыборкаДетальныеЗаписи.ссылка; 
	//КонецЕсли; 	
	//Возврат Справочники.ШтрихкодыУпаковокТоваров.ПустаяСсылка(); 
	Возврат Обработки.ПоискИнформацииПоКМ.НайтиШКПоКМНаименование(КМ); 
	
КонецФункции // НайтиШКПоКМ()

// <Описание процедуры>
//
// Параметры:
//  <Параметр1>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//  <Параметр2>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//
&НаКлиенте
Процедура ПослеВыбораДокумента(ВыбранноеЗначение,ДополнительныеПараметры) Экспорт 

	Если ВыбранноеЗначение = Неопределено Тогда
	
		Возврат;
	Конецесли; 
	
	ДанныеКМ.Очистить();  
	ИнформацияТЧ.Очистить();
		
	Если ТипЗнч(ВыбранноеЗначение) = Тип("ДокументСсылка.ЗаказНаЭмиссиюКодовМаркировкиСУЗ") Тогда 
		
		ЗаполнитьДанныеПоЗаказуКМ(ВыбранноеЗначение); 
		
	ИначеЕсли ТипЗнч(ВыбранноеЗначение) = Тип("ДокументСсылка.МаркировкаТоваровИСМП") Тогда 
		
		ЗаполнитьДанныеПоОперацииМаркировка(ВыбранноеЗначение); 
		
	ИначеЕсли ТипЗнч(ВыбранноеЗначение) = Тип("ДокументСсылка.ПриходнаяНакладная") Тогда
		
		ЗаполнитьДанныеПоХКМДокОснованию(ВыбранноеЗначение);
		//++Данилова Е.В. 20.10.2025 MARK-3138
	ИначеЕсли ТипЗнч(ВыбранноеЗначение) = Тип("ДокументСсылка.ХранилищеКодовМаркировки") Тогда
		
		ЗаполнитьДанныеПоХКМ(ВыбранноеЗначение); 
		
	ИначеЕсли ТипЗнч(ВыбранноеЗначение) = Тип("ДокументСсылка.РекламационнаяНакладная") Тогда
		
		ЗаполнитьДанныеПоХКМДокОснованию(ВыбранноеЗначение);
		//--Данилова Е.В. 20.10.2025
		
	КонецЕсли;
	
	ПерезаполнитьНомерСтроки(); 
	
КонецПроцедуры // ВыбранныйДокумент()

&НаСервере
Функция ЗаполнитьДанныеПоЗаказуКМ(Знач ЗаказКМ)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ШтрихкодыУпаковокТоваров.Ссылка КАК ШКУпаковки,
		|	ШтрихкодыУпаковокТоваров.Наименование КАК ЗначениеШК
		|ИЗ
		|	Справочник.ШтрихкодыУпаковокТоваров КАК ШтрихкодыУпаковокТоваров
		|ГДЕ
		|	ШтрихкодыУпаковокТоваров.ЗаказКМ = &ЗаказКМ";
	
	Запрос.УстановитьПараметр("ЗаказКМ", ЗаказКМ);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		НоваяСтрока = ДанныеКМ.Добавить(); 
		ЗаполнитьЗначенияСвойств(НоваяСтрока,ВыборкаДетальныеЗаписи); 
	КонецЦикла; 


КонецФункции // ()

&НаСервере
Функция ЗаполнитьДанныеПоОперацииМаркировка(Знач ОперацияМаркировка)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	МаркировкаТоваровИСМПШтрихкодыУпаковок.ШтрихкодУпаковки КАК ШКУпаковки,
		|	МаркировкаТоваровИСМПШтрихкодыУпаковок.ШтрихкодУпаковки.Наименование КАК ЗначениеШК
		|ИЗ
		|	Документ.МаркировкаТоваровИСМП.ШтрихкодыУпаковок КАК МаркировкаТоваровИСМПШтрихкодыУпаковок
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.МаркировкаТоваровИСМП КАК МаркировкаТоваровИСМП
		|		ПО МаркировкаТоваровИСМПШтрихкодыУпаковок.Ссылка = МаркировкаТоваровИСМП.Ссылка
		|ГДЕ
		|	МаркировкаТоваровИСМП.Ссылка = &Ссылка
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	МаркировкаТоваровИСМПШтрихкодыУпаковок.ШтрихкодНабора,
		|	МаркировкаТоваровИСМПШтрихкодыУпаковок.ШтрихкодНабора.Наименование
		|ИЗ
		|	Документ.МаркировкаТоваровИСМП.ШтрихкодыУпаковок КАК МаркировкаТоваровИСМПШтрихкодыУпаковок
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.МаркировкаТоваровИСМП КАК МаркировкаТоваровИСМП
		|		ПО МаркировкаТоваровИСМПШтрихкодыУпаковок.Ссылка = МаркировкаТоваровИСМП.Ссылка
		|			И (МаркировкаТоваровИСМПШтрихкодыУпаковок.ШтрихкодНабора <> ЗНАЧЕНИЕ(Справочник.ШтрихкодыУпаковокТоваров.ПустаяСсылка))
		|ГДЕ
		|	МаркировкаТоваровИСМП.Ссылка = &Ссылка
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	МаркировкаТоваровИСМПШтрихкодыУпаковок.ШтрихкодКоробки,
		|	МаркировкаТоваровИСМПШтрихкодыУпаковок.ШтрихкодКоробки.Наименование
		|ИЗ
		|	Документ.МаркировкаТоваровИСМП.ШтрихкодыУпаковок КАК МаркировкаТоваровИСМПШтрихкодыУпаковок
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.МаркировкаТоваровИСМП КАК МаркировкаТоваровИСМП
		|		ПО МаркировкаТоваровИСМПШтрихкодыУпаковок.Ссылка = МаркировкаТоваровИСМП.Ссылка
		|			И (МаркировкаТоваровИСМПШтрихкодыУпаковок.ШтрихкодКоробки <> ЗНАЧЕНИЕ(Справочник.ШтрихкодыУпаковокТоваров.ПустаяСсылка))
		|ГДЕ
		|	МаркировкаТоваровИСМП.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", ОперацияМаркировка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		НоваяСтрока = ДанныеКМ.Добавить(); 
		ЗаполнитьЗначенияСвойств(НоваяСтрока,ВыборкаДетальныеЗаписи); 
	КонецЦикла;
	
	


КонецФункции // ()

// <Описание функции>
//
// Параметры:
//  <Параметр1>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//  <Параметр2>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//
// Возвращаемое значение:
//   <Тип.Вид>   - <описание возвращаемого значения>
//
&НаСервере
Функция ЗаполнитьДанныеПоХКМДокОснованию(Знач ДокОснование)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ХранилищеКодовМаркировкиШтрихкодыУпаковок.ШтрихкодУпаковки КАК ШКУпаковки,
		|	ХранилищеКодовМаркировкиШтрихкодыУпаковок.ШтрихкодУпаковки.Наименование КАК ЗначениеШК
		|ИЗ
		|	Документ.ХранилищеКодовМаркировки.ШтрихкодыУпаковок КАК ХранилищеКодовМаркировкиШтрихкодыУпаковок
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ХранилищеКодовМаркировки КАК ХранилищеКодовМаркировки
		|		ПО ХранилищеКодовМаркировкиШтрихкодыУпаковок.Ссылка = ХранилищеКодовМаркировки.Ссылка
		|ГДЕ
		|	ХранилищеКодовМаркировки.ДокОснование = &ДокОснование
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	ХранилищеКодовМаркировкиШтрихкодыУпаковок.ШтрихкодНабора,
		|	ХранилищеКодовМаркировкиШтрихкодыУпаковок.ШтрихкодНабора.Наименование
		|ИЗ
		|	Документ.ХранилищеКодовМаркировки.ШтрихкодыУпаковок КАК ХранилищеКодовМаркировкиШтрихкодыУпаковок
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ХранилищеКодовМаркировки КАК ХранилищеКодовМаркировки
		|		ПО ХранилищеКодовМаркировкиШтрихкодыУпаковок.Ссылка = ХранилищеКодовМаркировки.Ссылка
		|			И (ХранилищеКодовМаркировкиШтрихкодыУпаковок.ШтрихкодНабора <> ЗНАЧЕНИЕ(Справочник.ШтрихкодыУпаковокТоваров.ПустаяСсылка))
		|ГДЕ
		|	ХранилищеКодовМаркировки.ДокОснование = &ДокОснование
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	ХранилищеКодовМаркировкиШтрихкодыУпаковок.ШтрихкодКоробки,
		|	ХранилищеКодовМаркировкиШтрихкодыУпаковок.ШтрихкодКоробки.Наименование
		|ИЗ
		|	Документ.ХранилищеКодовМаркировки.ШтрихкодыУпаковок КАК ХранилищеКодовМаркировкиШтрихкодыУпаковок
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ХранилищеКодовМаркировки КАК ХранилищеКодовМаркировки
		|		ПО ХранилищеКодовМаркировкиШтрихкодыУпаковок.Ссылка = ХранилищеКодовМаркировки.Ссылка
		|			И (ХранилищеКодовМаркировкиШтрихкодыУпаковок.ШтрихкодКоробки <> ЗНАЧЕНИЕ(Справочник.ШтрихкодыУпаковокТоваров.ПустаяСсылка))
		|ГДЕ
		|	ХранилищеКодовМаркировки.ДокОснование = &ДокОснование";
	
	Запрос.УстановитьПараметр("ДокОснование", ДокОснование);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		НоваяСтрока = ДанныеКМ.Добавить(); 
		ЗаполнитьЗначенияСвойств(НоваяСтрока,ВыборкаДетальныеЗаписи);
	КонецЦикла;

КонецФункции // ЗаполнитьДанныеПоХКМПНК()

// <Описание процедуры>
//
// Параметры:
//  <Параметр1>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//  <Параметр2>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//
&НаКлиенте
Процедура УстановитьВидимостьКнопкиОтбор()

	Элементы.ИнформацияТЧВключитьОтбор.Видимость = НЕ ОтборПоСтрокам; 
	Элементы.ИнформацияТЧОтключитьОтбор.Видимость = ОтборПоСтрокам; 

КонецПроцедуры // УстановитьЦветКнопкиОтбор()

&НаКлиенте
Функция ВвестиКоды()
	мКоды = Новый Массив;
	СтрокаКодов = "";
	Если ВвестиСтроку(СтрокаКодов, "Введите коды маркировки", , Истина) Тогда
		Для Каждого Строка Из СтрРазделить(СтрокаКодов, Символы.ПС) Цикл
			Строка = СтрЗаменить(Строка,"(01)","");		
			Строка = СтрЗаменить(Строка,"(21)","");		
			Строка = СтрЗаменить(Строка," ","");		
			
			ШтрихкодУпаковки = НайтиШтрихКодНаСервере(Строка);
			Если НЕ ШтрихкодУпаковки.Пустая() Тогда
				мКоды.Добавить(ШтрихкодУпаковки);
			Иначе 
				мКоды.Добавить(Строка);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;	
	
	Возврат мКоды;
КонецФункции
// <Описание функции>
//
// Параметры:
//  <Параметр1>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//  <Параметр2>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//
// Возвращаемое значение:
//   <Тип.Вид>   - <описание возвращаемого значения>
//
&НаСервереБезКонтекста
Функция НайтиШтрихКодНаСервере(Строка)

	 Возврат Справочники.ШтрихкодыУпаковокТоваров.НайтиПоНаименованию(Строка, Истина)

КонецФункции // НайтиШтрихКодНаСервере()

&НаКлиенте
Процедура Подбор(Команда)
	
	ОповещениеВыбора = Новый ОписаниеОповещения("ПослеВыбораЗначенийШК",ЭтаФорма); 
	
	ПараметрыОткрытияФормы = Новый Структура; 
	ПараметрыОткрытияФормы.Вставить("РежимВыбора",Истина);
	ПараметрыОткрытияФормы.Вставить("МножественныйВыбор",Истина);
	ПараметрыОткрытияФормы.Вставить("ЗакрыватьПриВыборе",Истина);
	
	ОткрытьФорму("Справочник.ШтрихкодыУпаковокТоваров.ФормаВыбора",ПараметрыОткрытияФормы,ЭтаФорма,,,,ОповещениеВыбора,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца); 
		
КонецПроцедуры

// <Описание процедуры>
//
// Параметры:
//  <Параметр1>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//  <Параметр2>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//
&НаКлиенте
Процедура ПослеВыбораЗначенийШК(ПараметрЗакрытия,ДополнительныеПараметры) Экспорт
	
КонецПроцедуры // ()


&НаКлиенте
Процедура ОтработатьПодборШК(Знач ВыбранноеЗначение)
	
	Перем СтрокаТЧ, ЭлементМассива;
	
	Если ТипЗнч(ВыбранноеЗначение) = Тип("Массив") Тогда
		Для каждого ЭлементМассива Из ВыбранноеЗначение Цикл
			
			СтрокаТЧ = ДанныеКМ.Добавить();							
			СтрокаТЧ.ШКУпаковки = ЭлементМассива;
			СтрокаТЧ.ЗначениеШК = ЗначениеРеквизитаШКУпаковки(ЭлементМассива);
			
		КонецЦикла;
		
	ИначеЕсли ТипЗнч(ВыбранноеЗначение) = Тип("СправочникСсылка.ШтрихкодыУпаковокТоваров") Тогда
		
		СтрокаТЧ = ДанныеКМ.Добавить();							
		СтрокаТЧ.ШКУпаковки = ВыбранноеЗначение;
		СтрокаТЧ.ЗначениеШК = ЗначениеРеквизитаШКУпаковки(ВыбранноеЗначение);
		
		
	КонецЕсли;
	
КонецПроцедуры

// <Описание функции>
//
// Параметры:
//  <Параметр1>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//  <Параметр2>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//
// Возвращаемое значение:
//   <Тип.Вид>   - <описание возвращаемого значения>
//
&НаСервереБезКонтекста
Функция СтатусЧЗФакт(Знач ШК)

	//Запрос = Новый Запрос;
	//Запрос.Текст = 
	//	"ВЫБРАТЬ
	//	|	СтатусыКМ_ФактСрезПоследних.Статус КАК Статус,
	//	|	СтатусыКМ_ФактСрезПоследних.Местонахождение КАК Местонахождение
	//	|ИЗ
	//	|	РегистрСведений.СтатусыКМ_Факт.СрезПоследних(, ШтрихКодУпаковки = &ШК) КАК СтатусыКМ_ФактСрезПоследних";
	//
	//Запрос.УстановитьПараметр("ШК", ШК);
	//
	//РезультатЗапроса = Запрос.Выполнить();
	//
	//ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	//Если ВыборкаДетальныеЗаписи.Следующий() Тогда
	//	
	//	Возврат   Новый Структура("Статус,Местонахождение",ВыборкаДетальныеЗаписи.Статус,ВыборкаДетальныеЗаписи.Местонахождение); 
	//	
	//КонецЕсли;
	//
	//Возврат Новый Структура("Статус,Местонахождение",Перечисления.СтатусыКодовМаркировкиФакт.ПустаяСсылка(),неопределено); 
	
	Возврат Обработки.ПоискИнформацииПоКМ.ДанныеПоСтатусамФакт(ШК); 
	
КонецФункции // СтатусЧЗФакт()

// <Описание функции>
//
// Параметры:
//  <Параметр1>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//  <Параметр2>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//
// Возвращаемое значение:
//   <Тип.Вид>   - <описание возвращаемого значения>
//
&НаКлиентеНаСервереБезКонтекста
Функция ПереводЗначенияАПИ(ЗначениеПоляОтвет,Перевод)
	
	 ЗначениеПоля = ВРег(ЗначениеПоляОтвет); 
	 
	 Если Перевод.Получить(ЗначениеПоля) = неопределено  Тогда
		 
		 Возврат ЗначениеПоляОтвет; 	
	 Иначе 
		 Возврат  Перевод.Получить(ЗначениеПоля); 
	 КонецЕсли;
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ПереводЗначенияАПИСоответствие()
		
	Перевод = Новый Соответствие;
	
	//Органы государственной  власти, установившие блокировку на КМ
	Перевод.Вставить("RAR","Росалкогольрегулирование");
	Перевод.Вставить("FTS","ФТС России");
	Перевод.Вставить("FNS","ФНС России");
	Перевод.Вставить("RSHN","Россельхознадзор");
	Перевод.Вставить("MVD","МВД России");
	Перевод.Вставить("RPN","Роспотребнадзор");
	Перевод.Вставить("RZN","Роспотребнадзор");
	
	//вид товарооборота 
	Перевод.Вставить("SELLING","Продажа");
	Перевод.Вставить("CONTRACT","Передача по АКС");
	
	//виды разреш. документации 
	Перевод.Вставить("CONFORMITY_CERTIFICATE","Сертификат соответствия");
	Перевод.Вставить("CONFORMITY_DECLARATION","Декларация о соответствии");
	Перевод.Вставить("STATE_REGISTRATION_CERTIFICATE","Свидетельство о государственной регистрации");
	
	//типы эмиссии 
	Перевод.Вставить("LOCAL","Производство РФ");
	Перевод.Вставить("FOREIGN","Ввезён в РФ");
	Перевод.Вставить("REMAINS","Маркировка остатков");
	Перевод.Вставить("CROSSBORDER","Ввезён из стран ЕАЭС");
	Перевод.Вставить("REMARK","Перемаркировка");	 
	Перевод.Вставить("COMMISSION","Принят на комиссию от физического лица");
	Перевод.Вставить("REAPPLY","Маркировка вне производства или импорта");
	//статусы
	Перевод.Вставить("EMITTED","Эмитирован");
	Перевод.Вставить("APPLIED","Нанесён");
	Перевод.Вставить("INTRODUCED","В обороте");
	Перевод.Вставить("WRITTEN_OFF","Списан");
	Перевод.Вставить("RETIRED","Выбыл");
	Перевод.Вставить("WITHDRAWN","Выбыл");
	Перевод.Вставить("DISAGGREGATION","Расформирован");
	Перевод.Вставить("DISAGGREGATED","Расформирован");
	Перевод.Вставить("APPLIED_NOT_PAID","Не оплачен");
	//особые актуальные состояния 
	Перевод.Вставить("EMPTY","Значение отсутствует");
	Перевод.Вставить("RESERVED_NOT_USED","Зарезервировано. Не использовать.");
	Перевод.Вставить("INDIVIDUAL","индивидуализирован");
	Перевод.Вставить("NON_INDIVIDUAL","не индивидуализирован");
	Перевод.Вставить("WAIT_SHIPMENT","Ожидает подтверждения приёмки");
	Перевод.Вставить("EXPORTED","Используется для документов экспорта");
	Перевод.Вставить("LOAN_RETIRED","Выведен из оборота по договору рассрочки");
	
	Перевод.Вставить("REMARK_RETIRED","Выведен из оборота при перемаркировке");
	Перевод.Вставить("WAIT_TRANSFER_TO_OWNER","Ожидает передачу собственнику");
	Перевод.Вставить("WAIT_REMARK","Товар ожидает перемаркировку или КИ списан после нанесения на товар");
	Перевод.Вставить("RETIRED_CANCELLATION","Выведен из оборота при перемаркировке");
	Перевод.Вставить("FTS_RESPOND_NOT_OK","Отрицательное решение ФТС");
	Перевод.Вставить("FTS_RESPOND_WAITING","Ожидает подтверждение ФТС");	 
	Перевод.Вставить("FTS_CONTROL","На контроле ФТС");
	Перевод.Вставить("EAS_RESPOND_NOT_OK","Отрицательное решение ЕАЭС");
	Перевод.Вставить("EAS_RESPOND_WAITING","Ожидает подтверждение ЕАЭС"); 
	Перевод.Вставить("LOST_INVENTORY","Не найден по итогу инвентаризации");
	
	//типы упаковок 
	
	Перевод.Вставить("UNIT","Единица товара");
	Перевод.Вставить("GROUP","Групповая упаковка");
	Перевод.Вставить("LEVEL1","Упаковка 1-го уровня (блочок)");
	Перевод.Вставить("LEVEL2","Упаковка 2-го уровня (короб)");
	Перевод.Вставить("LEVEL3","Упаковка 3-го уровня (палета)");
	Перевод.Вставить("LEVEL4","Упаковка 4-го уровня");
	Перевод.Вставить("LEVEL5","Упаковка 5-го уровня");
	Перевод.Вставить("BUNDLE","Комплект");
	Перевод.Вставить("BOX","Транспортная упаковка (КИТУ)");
	Перевод.Вставить("ATK","Агрегированный таможенный код");
	Перевод.Вставить("SET","Набор");
	Перевод.Вставить("BUNDLE","Комплект");
	
	
	//причины выбытия 
	Перевод.Вставить("AUTO_CANCELLATION","Аннулирование неиспользованных КМ по истечении срока");
	Перевод.Вставить("BALANCE_CORRECTION","Корректировка остатков (ОСУ)");
	Перевод.Вставить("BEFORE_MARKING","Выбытие до обязательности маркировки");
	Перевод.Вставить("BEYOND_EEC_EXPORT","Экспорт за пределы стран ЕАЭС");
	Перевод.Вставить("BY_SAMPLES","Продажа по образцам");
	Перевод.Вставить("COMPLAINTS","Рекламации");
	Перевод.Вставить("CONFISCATION","Конфискация");
	Перевод.Вставить("DAMAGE_LOSS","Утрата");
	Перевод.Вставить("DEFECT","Повреждение /брак");
	Перевод.Вставить("DEMO_SAMPLES","Демонстрационные образцы");
	Перевод.Вставить("DESCRIPTION_ERRORS","Выявлены ошибки описания товара");
	Перевод.Вставить("DESTRUCTION","Уничтожение");
	Перевод.Вставить("DISTANCE","Дистанционная продажа");
	Перевод.Вставить("DONATION","Безвозмездная передача");
	Перевод.Вставить("EAS_TRADE","Трансграничная продажа в страны ЕАЭС");
	Перевод.Вставить("EEC_EXPORT_RETURN","Возврат ранее экспортированного в ЕАЭС");
	Перевод.Вставить("EXPIRATION","Истечение срока годности");
	Перевод.Вставить("EXPIRY","Истечение срока годности");
	Перевод.Вставить("INTERNAL_RETURN","Решение о реализации товаров,приобретенных ранее в целях, не связанных с их реализацией");
	Перевод.Вставить("KM_CANCELLATION","Аннулирование неиспользованных КМ по инициативе участника оборота товаров");
	Перевод.Вставить("KM_DESTROYED","Уничтожение");
	Перевод.Вставить("KM_LOST","Утрата");
	Перевод.Вставить("KM_SPOILED","Испорчен");
	Перевод.Вставить("KM_SPOILED_OR_LOST","Испорчено либо утеряно СИ с КМ");
	Перевод.Вставить("LEGAL_RETURN","Возврат от конечного покупателя");
	Перевод.Вставить("LIQUIDATION","Ликвидация");
	Перевод.Вставить("LOSS","Утрата");
	Перевод.Вставить("OTHER","Прочее");
	Перевод.Вставить("OWN_USE","Использование для собственных нужд");
	Перевод.Вставить("OWN_USE_EXCISE","Списание для собственных нужд с уплатой акциза");	
	Перевод.Вставить("PACKING","Фасовка");
	Перевод.Вставить("PRODUCT_RECALL","Отзыв с рынка");
	Перевод.Вставить("PRODUCTION_USE","Использование для производственных целей");
	Перевод.Вставить("QA_SAMPLES","Лабораторные образцы");
	Перевод.Вставить("REMOTE_SALE_RETURN","Возврат товаров с поврежденным СИ / без СИ при дистанционном способе продажи");
	Перевод.Вставить("RETAIL","Розничная продажа");
	Перевод.Вставить("RETAIL_RETURN","Возврат товаров с повреждённым СИ / без СИ при розничной реализации");
	Перевод.Вставить("RETURN","Возврат физическому лицу");
	Перевод.Вставить("STATE_CONTRAC","Продажа по государственному (муниципальному) контракту");
	Перевод.Вставить("STATE_ENTERPRISE","Приобретение гос.предприятием");
	Перевод.Вставить("STATE_SECRET","Продажа по сделке с государственной тайной");
	Перевод.Вставить("UTILIZATION","Утилизация");	 
	Перевод.Вставить("VENDING","Продажа через вендинговый аппарат");
	Перевод.Вставить("NOT_FOR_SALE_RETURN","Возврат товара,возвращенного покупателем,приобретавшим его в целях, не связанных с последующей реализацией");
	Перевод.Вставить("OWN_USE_RETURN","Возврат товара, выведенного из оборота в целях, не связанных с их последующей реализацией");
	Перевод.Вставить("STATE_CONTRACT_RETURN","Возврат товара, выведенного из оборота для продажи по сделке с государственной тайной");
	Перевод.Вставить("VENDING_RETURN","Возврат товара, выведенного из оборота для продажи через вендинговый аппарат»");
	
	Возврат Перевод;
	
КонецФункции
 // ПереводЗначенияАПИ()
 
 &НаКлиенте
 Процедура ПерезаполнитьНомерСтроки(ИмяТаблицы = "ДанныеКМ")
	 
	 Для каждого СтрокаТЧ Из ЭтаФорма[ИмяТаблицы] Цикл
		 
		 СтрокаТЧ.НомерСтроки = ЭтаФорма[ИмяТаблицы].Индекс(СтрокаТЧ) + 1; 	  
		 
	 КонецЦикла;
	 
 КонецПроцедуры // ЗаполнитьНомерСтроки()
 
 &НаКлиенте
 Процедура ДанныеКМПриИзменении(Элемент)
	 ПерезаполнитьНомерСтроки();
 КонецПроцедуры

&НаКлиенте
 Процедура ВнешнееСобытие(Источник, Событие, Данные)
	 Если ТолькоПросмотр Тогда Возврат КонецЕсли;
	 Если НЕ ВводДоступен() Тогда Возврат КонецЕсли;
	 
	 Если НЕ ЭтоСобытиеСканера(Событие) Тогда Возврат КонецЕсли;
	 
	 глТорговоеОборудование.СканерПосылкаДанных(1);
	 глСобытиеСканераОтработано = Истина;
	 
	ОбработатьВводШК(Данные);	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьВводШК(Данные)
	Если СтрДлина(Данные) < 31 Тогда
		
		Сообщить("В данном документе разрешено сканировать товар только по кодам ЧЗ !", СтатусСообщения.Важное);				
		
	Иначе
		//Валетов + 25,11,2025 https://yougile.collant.ru/team/ab6bad3a05c0/#HELP-7967
		//Попались 10 кодов у которых GS стоит впереди.
		Если СтрНайти(Данные, Символ(29)) > 0 Тогда 
			Данные 	= СтрЗаменить(Данные, Символ(29), "");			
		КонецЕсли;
		//Валетов +	
		
		Данные 	= Лев(СтрЗаменить(Данные, Символы.ПС, ""), 31);
		
		ДобавитьЗначениеШКОтсканированное(Данные);
		
		ПерезаполнитьНомерСтроки();
		
	КонецЕсли;		
КонецПроцедуры //ОбработатьВводШК(Данные)


&НаСервере
Функция ДобавитьЗначениеШКОтсканированное(Знач ДанныеОтсканир)
	ДанныеОтсканир	= Лев(СтрЗаменить(ДанныеОтсканир, Символы.ПС, ""), 31);
	
	Результат	= МаркировкаКС.СтруктураРезультата(Ложь);
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	Владелец		КАК Номенклатура,
	|	Владелец.Код	КАК Номенклатура_Код,
	|	Ссылка 			КАК КодМаркировки,
	|	СпособВводаВОборот
	|ИЗ
	|	Справочник.ШтрихкодыУпаковокТоваров	
	|ГДЕ
	|	Наименование = &ДанныеКМ
	|	И ( 
	|		ТипКода = ЗНАЧЕНИЕ(Перечисление.ТипыКодовМаркировки.Товар)
	|		ИЛИ ТипКода = ЗНАЧЕНИЕ(Перечисление.ТипыКодовМаркировки.Набор)
	|	)
	|";
	
	Запрос.УстановитьПараметр("ДанныеКМ", ДанныеОтсканир);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() И ЗначениеЗаполнено(Выборка.КодМаркировки) Тогда
		СтрокаТЧ = ДанныеКМ.Добавить(); 		
		СтрокаТЧ.ШКУпаковки = Выборка.КодМаркировки;	
		СтрокаТЧ.ЗначениеШК = ДанныеОтсканир;
		
	Иначе
		СтрокаТЧ = ДанныеКМ.Добавить(); 		
		СтрокаТЧ.ЗначениеШК = ДанныеОтсканир;		
	КонецЕсли; 

	Возврат Результат;
КонецФункции //НайтиТоварПоКМ(ДанныеКМ)
 
&НаКлиенте
 Процедура Проверка1С(Команда)
	 
	ИнформацияТЧ.Очистить();
	
	МассивКМ = ПолучитьМассивКМНаСервере();
	
	
	ПараметрыФона = Новый Массив; 
	ПараметрыФона.Добавить(МассивКМ); 
	
	
	пВыполнения = инт_ДлительныеОперации.ПараметрыВыполненияФункции(Новый УникальныйИдентификатор);
	
	рЗапуска = инт_ДлительныеОперации.ВыполнитьВФоне("Обработка.ПоискИнформацииПоКМ.ПолучитьДанныеПоКодамКМ", ПараметрыФона, пВыполнения);	
	
	Если рЗапуска.Статус = "Ошибка" Тогда
		Сообщить(рЗапуска.ПодробноеПредставлениеОшибки, СтатусСообщения.Важное);
		Возврат;
	КонецЕсли;
	
	пОжидания = инт_ДлительныеОперацииК.ПараметрыОжидания(ЭтотОбъект);
	пОжидания.ВыводитьПрогрессВыполнения = Истина;
	пОжидания.Заголовок = "Получение данных по КМ из базы 1С";
	
	ооЗавершение = Новый ОписаниеОповещения("ОжиданиеЗавершенияФЗ", ЭтотОбъект,Новый Структура("ЗапросВЧЗ",Ложь));
	
	инт_ДлительныеОперацииК.ОжидатьЗавершение(рЗапуска, ооЗавершение, пОжидания);
КонецПроцедуры

&НаСервере
Процедура ПроверитьКодыБезФонаНаСервере()
	
	ИнформацияТЧ.Очистить();
	
	МассивКМ = ПолучитьМассивКМНаСервере();
	
	ОбработкаАПи = Обработки.АпиЧЗ.Создать(); 
	РезультатОтработки  = ОбработкаАПи.ПолучитьДанныеИзЧЗПоКодамКМ(МассивКМ); 
	
	Если ТипЗнч(РезультатОтработки) = Тип("Структура") Тогда		
				
		ОтработатьУспешныйРезультат(РезультатОтработки);
		
		ОтработатьНеНайденныеКодыКМ(РезультатОтработки);
	Иначе 
		Сообщить("Некорректный тип результата запросы: " + ТипЗнч(РезультатОтработки)+" ! Ожидаемый тип: 'Структура' !", СтатусСообщения.Важное);
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьКодыБезФона(Команда)
	ПроверитьКодыБезФонаНаСервере();
КонецПроцедуры

//++Данилова Е.В. 20.10.2025 MARK-3138
&НаСервере
Функция ЗаполнитьДанныеПоХКМ(Знач ХКМ)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ХранилищеКодовМаркировкиШтрихкодыУпаковок.ШтрихкодУпаковки КАК ШКУпаковки,
		|	ХранилищеКодовМаркировкиШтрихкодыУпаковок.ШтрихкодУпаковки.Наименование КАК ЗначениеШК
		|ИЗ
		|	Документ.ХранилищеКодовМаркировки.ШтрихкодыУпаковок КАК ХранилищеКодовМаркировкиШтрихкодыУпаковок
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ХранилищеКодовМаркировки КАК ХранилищеКодовМаркировки
		|		ПО ХранилищеКодовМаркировкиШтрихкодыУпаковок.Ссылка = ХранилищеКодовМаркировки.Ссылка
		|ГДЕ
		|	ХранилищеКодовМаркировки.ссылка = &ссылка
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	ХранилищеКодовМаркировкиШтрихкодыУпаковок.ШтрихкодНабора,
		|	ХранилищеКодовМаркировкиШтрихкодыУпаковок.ШтрихкодНабора.Наименование
		|ИЗ
		|	Документ.ХранилищеКодовМаркировки.ШтрихкодыУпаковок КАК ХранилищеКодовМаркировкиШтрихкодыУпаковок
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ХранилищеКодовМаркировки КАК ХранилищеКодовМаркировки
		|		ПО ХранилищеКодовМаркировкиШтрихкодыУпаковок.Ссылка = ХранилищеКодовМаркировки.Ссылка
		|			И (ХранилищеКодовМаркировкиШтрихкодыУпаковок.ШтрихкодНабора <> ЗНАЧЕНИЕ(Справочник.ШтрихкодыУпаковокТоваров.ПустаяСсылка))
		|ГДЕ
		|	ХранилищеКодовМаркировки.ссылка = &ссылка
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	ХранилищеКодовМаркировкиШтрихкодыУпаковок.ШтрихкодКоробки,
		|	ХранилищеКодовМаркировкиШтрихкодыУпаковок.ШтрихкодКоробки.Наименование
		|ИЗ
		|	Документ.ХранилищеКодовМаркировки.ШтрихкодыУпаковок КАК ХранилищеКодовМаркировкиШтрихкодыУпаковок
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ХранилищеКодовМаркировки КАК ХранилищеКодовМаркировки
		|		ПО ХранилищеКодовМаркировкиШтрихкодыУпаковок.Ссылка = ХранилищеКодовМаркировки.Ссылка
		|			И (ХранилищеКодовМаркировкиШтрихкодыУпаковок.ШтрихкодКоробки <> ЗНАЧЕНИЕ(Справочник.ШтрихкодыУпаковокТоваров.ПустаяСсылка))
		|ГДЕ
		|	ХранилищеКодовМаркировки.ссылка = &ссылка";
	
	Запрос.УстановитьПараметр("ссылка", ХКМ);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		НоваяСтрока = ДанныеКМ.Добавить(); 
		ЗаполнитьЗначенияСвойств(НоваяСтрока,ВыборкаДетальныеЗаписи);
	КонецЦикла;

КонецФункции // ЗаполнитьДанныеПоХКМПНК()

 //--Данилова Е.В. 20.10.2025
